posts/2017-10-24-when-the-idols-are-destroyed.org
#+title: "When the Idols are Destroyed"
#+date: <2017-10-24>
#+filetags: prayer religion


Holy God,

We come to you bearing many things.  
Some are burdens, but others are idols:

The idol of superiority,

The idol of certainty,

The idol of believing that   
we are the gatekeepers to your kingdom,

The idol of making the gospel   
an object of mere belief,  
and not a way of life.

But when the burdens are lifted,  
and the idols are destroyed,  
What remains is truly precious:

Women and men in community,  
Gifted people of all ages  
working together so that  
your kingdom may come,  
and your will be done  
even here, even now.

/Amen/


