docs/posts/2017-10-24-when-the-idols-are-destroyed.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>When the Idols are Destroyed</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">When the Idols are Destroyed</h1>
<p class="subtitle" role="doc-subtitle">Oct 24, 2017</p>
</header><p>
Holy God,
</p>

<p>
We come to you bearing many things.  
Some are burdens, but others are idols:
</p>

<p>
The idol of superiority,
</p>

<p>
The idol of certainty,
</p>

<p>
The idol of believing that   
we are the gatekeepers to your kingdom,
</p>

<p>
The idol of making the gospel   
an object of mere belief,  
and not a way of life.
</p>

<p>
But when the burdens are lifted,  
and the idols are destroyed,  
What remains is truly precious:
</p>

<p>
Women and men in community,  
Gifted people of all ages  
working together so that  
your kingdom may come,  
and your will be done  
even here, even now.
</p>

<p>
<i>Amen</i>
</p>




<div class="tagline" id="org7767c11">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
